import streamlit as st
import pandas as pd   # 导入Pandas并用pd代替
import streamlit as st  # 导入Streamlit并用st代表

#https://www.emojiall.com/zh-hans
#利用st.text展示基本文字信息
#标题
st.title("学生张三-学生档案")
st.header("🔑  基础信息")
#基础信息


st.text("当前教室：实训楼-108")
col1, col2 ,col3= st.columns(3)
# 第一列文字
with col1:
    st.text("学生ID：1433223-20250-12-11")
# 第二列文字
with col2:
    st.text("注册时间：")
    st.text("当前教室：实训楼-108")
with col3:
    st.caption('2025-12-11')


#当前任务进度条显示，相关知识于网上获取
st.title("当前课程进度：")
st.progress(0.10)

#技能矩阵
st.title("📊技能矩阵")
st.text("法律")

#使用并列铺放显示
col1, col2,col3 = st.columns(3)
# 第一列文字
with col1:
    st.text("法律",help='民法相关')
    st.markdown('##### 95%')
    st.caption('↑2%')
# 第二列文字
with col2:
    st.text("语言艺术",help='律师的表达语言')
    st.markdown('##### 96%')
    st.caption('⬇︎-1%')

 # 第三列文字 
with col3:
    st.text("宪法")
    st.markdown('##### 92%')
    st.caption('⬇︎10%')

st.title("📅任务日志")

#相关数据
data = {
    '日期':['2025-12-01', '2025-12-03', '2025-12-06', '2025-12-09','2025-12-12'],
    '任务':["宪法学习", '教学', '法制科普', '宪法模拟竞赛', '考试'],
    '状态':["完成", '进行中', '进行中', '未完成', '未完成'],  # 补全逗号，修复长度问题
    '难度':['难','易','易','中','中'],
}

#索引设置
index = pd.Series(['01', '02', '03', '04', '05'], name='任务编号')
# 创建DataFrame
df = pd.DataFrame(data, index=index)

#'默认显示
st.subheader('默认显示')
st.dataframe(df)

#最新代码成果
st.title("🔒最新代码成果")
st.subheader('Python代码块')
# 创建要显示的Python代码块的内容
python_code = '''def hello():
st.text("Hello World!")
st.title("这是标题")
st.header("这是章节")
st.subheader("这是子章节")
st.text("Hello World!",help="这是帮助")
等等
'''

# 并设置line_numbers为True，即该代码块有行号
st.code(python_code, line_numbers=True)

st.markdown('##### 系统状态：在线 链接状态：已加密')
